# process_data.py

# 人工輸入區
machine_num = "1612C"  # 機器代號
machine_series = "JZ3"  # 採樣地點
file_dir = "TG10-01612-2024-01-29T073000.data.txt"  # 你要用的 data
usecols = ['DATE', 'TIME', 'CH4']  # 你要抓的資料(記得要改格式)
gas_column = ['CH4']  # 你要抓的資料(記得要改格式)
gas_type = "暗"
Real_time = "2024/01/30 02:05:30"  # 實際時間
Machine_time = "2024/01/30 02:14:01"  # 機器時間
Rtime = ["2024/01/29 10:13:50",
         "2024/01/29 10:20:30",
         "2024/01/29 10:27:10",
         "2024/01/29 10:34:05",
         "2024/01/29 10:40:55",
         "2024/01/29 10:57:00"]  # 六項實際時間

# machine_num = "1098"  # 機器代號
# machine_series = "JZ5"  # 採樣地點
# file_dir = "TG20-01098-2023-10-25T090000.data.txt"  # 你要用的 data
# usecols = ['DATE', 'TIME', 'N2O']  # 你要抓的資料(記得要改格式)
# gas_column = ['N2O']  # 你要抓的資料(記得要改格式)
# gas_type = "亮"
# Real_time = "2023/10/25 21:31:09"  # 實際時間
# Machine_time = "2023/10/25 21:45:23"  # 機器時間
# Rtime = ["2023/10/25 12:01:45",
#          "2023/10/25 12:10:15",
#          "2023/10/25 11:02:00",
#          "2023/10/25 11:54:10",
#          "2023/10/25 12:45:00",
#          "2023/10/25 12:21:00"]  # 六項實際時間

# machine_num = "1696"  # 機器代號
# machine_series = "JZ2"  # 採樣地點
# file_dir = "TG10-01696-2023-10-25T090000.data.txt"  # 你要用的 data
# usecols = ['DATE', 'TIME', 'CO2']  # 你要抓的資料(記得要改格式)
# gas_column = ['CO2']  # 你要抓的資料(記得要改格式)
# Real_time = "2023/10/25 20:35:40"  # 實際時間
# Machine_time = "2023/10/25 20:38:21"  # 機器時間
# Rtime = ["2023/10/25 16:14:10",
#          "2023/10/25 16:24:30",
#          "2023/10/25 16:34:00",
#          "2023/10/25 16:44:50",
#          "2023/10/25 16:56:25",
#          "2023/10/25 16:56:25"]  # 六項實際時間